
answer = input("Сиз бул сууро жооп оюнун ойнойсузбу? (оба/жок) ")

if answer.lower().strip() == "оба":

    answer = input("Жолдун кесилишине жеттиңиз, солгобу же онгобу?").lower().strip()

    if answer == "солго":
        answer = input("Желмогузга каршы турасыз, чуркагыңыз келеби же кармашкыныз келеби..")

        if answer == "кармашкым":
            print("Бул эң сонун идея эмес болчу, сиз утулуп калдыңыз!")
        else:
            print("Жакшы тандоо, сиз аны аман-эсен кеттиңиз.")

            answer = input("Сиз эки нерсе коруп турасыз. Кайсынысын алгыңыз келет? (унаа/учак) ")

            if answer == "учак":
                print("Тилекке каршы, сиз учканды билбейсиз... Оюн бүттү!")
            else:
                print("Сиз жендиниз!")

    elif answer == "онго":
        print("Максатсыз оң тарапка басып, муз жолго жыгыласың. Бутуңду жарадар кылып, уланта албайсың. Оюн бүттү!")

    else:
        print("Жараксыз тандоо, утулуп калдыңыз!")

else:
    print("Бул жаман!")
